# ณ.ผับแห่งหนึ่งข้างร้านของลุงสมหมาย เป็นที่ ๆ ลุงสมหมายมักชอบแอบหนีป้าสมหมีภรรยาเอกลำดับที่ 3 ของแกไปนั่งทานข้าว
# กับสาว ๆ อยู่เป็นประจำ แต่วันหนึ่งเด็กชายเอ เพิ่งกลับจากการติวหนังสือเพื่อสอบเข้ามหาวิทยาลัยชื่อดังอันดับ 1 ของประเทศเด็กชาย
# เอ หิวข้าวมาก ๆ จนตาลายเดินไปยังร้านดังกล่าว แต่น่าเสียดายที่ร้านดังกล่าวมีหน่วยรักษาความปลอดภัยที่คอยเช็คคนเข้าออกอยู่ตลอด แต่
# ด้วยความที่เด็กชายเอนั้น เป็นเด็กที่มีชื่อเสียง และ เป็นลูกของรัฐมนตรีชั้นผู้ใหญ่ท่านหนึ่ง เด็กชายเอจึงเป็นเด็กคนเดียวที่อายุไม่ถึง 18 ปี แต่เข้าได้
# แต่คนอื่น ๆ ต่ำกว่า 18 ปีจะห้ามเข้าเด็ดขาด


Name = str(input(""))
years = int(input())


print(age)
if age >= 18 :
    print(f'Welcome {Name} i to NongGipsy Pub')
elif age < 18  :
    print('You shall not pass!')