#คำอธิบาย

#การเรียงลำดับตัวเลขก็คงไม่ใช่เรื่องยากอะไรอยู่แล้วสำหรับคนทั่ว ๆ ไป ก็แค่ดูว่าตัวเลขไหนมากที่สุดก็ให้อยู่ฝั่งหนึ่ง ถ้าน้อยที่สุดก็ให้อยู่อีกฝั่งหนึ่งเท่านั้นเอง
#โดยในวันนี้เด็กชาย A ต้องการที่จะเรียนรู้วิธีการเรียงลำดับเลขจากการเขียนโปรแกรม โดยจะทำการเรียงจากมากที่สุด ไปยังตัวเลขที่น้อยที่สุด โดยให้ทำการรับค่าตัวเลขมาจำนวน 5 ตัว 
#พร้อมเปรียบเทียบกันนั่นเอง ให้เราพัฒนาโปรแกรมดังกล่าว โดยดูตัวอย่างได้จากกรณีทดสอบด้านล่าง

n = 5
number = []

for i in range(n):
  numin = int(input())
  number.append(numin)
  
number.sort(reverse=True)

for i in range (n):
  print(number[i])
