#บันไดเป็นสิ่งที่เราพบเห็นได้ในชีวิตประจำวัน และ เป็นโจทย์ที่เราก็เคยทำกันไปแล้วทั้งนั้น ? เนื่องจากว่าเรานั้นได้ไปรับงานจากบริษัท
#ชื่อดังเรื่องการออกแบบรวมถึงรับเหมาก่อสร้างบ้าน ที่เขามักจะให้ลูกค้าของเขานั้น สามารถใส่จำนวนขั้นบันไดได้เอง แล้วโปรแกรมจะทำการ
#แสดงหน้าตาของบันไดที่ผู้ใช้งานได้กรอกตัวเลขลงไป (ที่เป็นจำนวนขั้น) และแสดงออกมาผ่านทางหน้าจอ ให้เราพัฒนาโปรแกรมดังกล่าว โดยดูตัวอย่างได้จากกรณีทดสอบด้านล่าง

num = int(input())
star = "*"

for i in range (num+1):

    star = "*" * i
    print(star)
    i += 1


