#อย่างที่ทราบกันว่าเดือนกุมภาพันธ์นั้นเป็นเดือนแห่งความรัก แน่นอนว่า "รักของคนสองคนมักไม่เท่ากัน" คนหนึ่งอาจจะรักมากกว่าอีกคนหนึ่งก็ได้ 
# ซึ่งแน่นอนว่าเรื่องที่กล่าวมาข้างต้นนั้นไม่เกี่ยวกับโจทย์ แต่โจทย์นี้เป็นเรื่องที่เกี่ยวกับเดือนดังกล่าวโดยตรง



#เราทุกคนมักทราบดีว่าเดือนดังกล่าวมีจำนวนวันที่ไม่เท่ากันในบางปี เช่น 28 วันบ้าง หรือ 29 วันบ้าง โดยเราทราบกันดีอยู่แล้วว่าทุก ๆ 4 ปี 
# (หรือปีที่หารเอาเศษด้วย 4 ลงตัวใน ปีแบบ ค.ศ.) เดือนดังกล่าวจะมีวันที่แปลกออกไป ซึ่งเรียกว่า "ปีอธิกสุรทิน" แต่ก็แน่นอนว่า เอาจริง ๆ 
# แล้วกฏเกณฑ์นี้ก็ไม่ได้ถูกเสมอไปว่าจะเป็นเช่นนั้น เพราะ ทุก ๆ ครั้งที่ปี ค.ศ. ดังกล่าวหารด้วย 100 
# ลงตัวก็ไม่ใช่ปีอธิกสุรทิน เช่นกัน และ ยังมีข้อยกเว้นเพิ่มเติมบางประการอีกด้วยว่า ปีดังกล่าวใช่ปี อธิกสุรทินหรือไม่



#เพื่อความกระจ่างแจ้งแล้วเราจะต้องพัฒนาโปรแกรมดังกล่าวเพื่อฝึกทักษะในการพัฒนาโปรแกรม และ การคิดค้นทางการแก้ไขปัญหาดังกล่าว 
# โดยจะให้รับค่าเข้าไปเป็นปี (ค.ศ.) และ ให้แสดงผลออกมาทางหน้าจอว่าปีดังกล่าวเป็นปีอธิกสุรทินหรือไม่ ถ้าใช่ให้แสดงว่า "Leap Year" 
# แต่ถ้าหากไม่ใช่ก็ให้แสดงว่า "Not a Leap Year" โดยให้เราพัฒนาโปรแกรมดังกล่าว โดยดูตัวอย่างได้จากกรณีทดสอบด้านล่าง

input_year = int(input())
def is_leap(year):
    if (year % 400 == 0) or (year % 4 == 0 and year % 100 != 0):
        return True


    return False

if is_leap(input_year):
    print("Leap Year")
else:
    print("Not a Leap Year")
