#โรงเรียนของเด็กชายเอ ขึ้นชื่อเรื่องความเข้มแข็งทางด้านวิชาการมาก ทำให้เด็กในโรงเรียนสามารถคว้ารางวัลโนเบลมาได้ทุกปี 
# แม้จะเป็นเพียงแค่เด็กประถมเท่านั้น ส่วนการตัดเกรดของอาจารย์นั้นจะใช้รูปแบบ A - F เช่นเดียวกับมหาวิทยาลัยชั้นนำทั่วไป 
# โดยเราในฐานะของโปรแกรมเมอร์ ที่ถูกโรงเรียนดังกล่าวว่าจ้างให้ทำการพัฒนาโปรแกรมคำนวณเกรดให้สมบูรณ์ และ มีเกณฑ์คะแนน 
# รวมถึงเกรดตามข้อมูลด้านล่าง

#ผู้ที่ได้คะแนนตั้งแต่ 90 คะแนนขึ้นไปจะได้เกรด A
#ผู้ที่ได้คะแนนตั้งแต่ 85 - 89 จะได้เกรด B+
#ผู้ที่ได้คะแนนตั้งแต่ 80 - 84 จะได้เกรด B
#ผู้ที่ได้คะแนนตั้งแต่ 75 - 79 จะได้เกรด C+
#ผู้ที่ได้คะแนนตั้งแต่ 70 - 74 จะได้เกรด C
#ผู้ที่ได้คะแนนตั้งแต่ 65 - 69 จะได้เกรด D+
#ผู้ที่ได้คะแนนตั้งแต่ 60 - 64 จะได้เกรด D
#ผู้ที่ได้คะแนนต่ำกว่า 60 ลงไปจะได้เกรด F
#โดยโปรแกรมดังกล่าวจะให้ผู้ใช้งาน"กรอก" ข้อมูลตัวเลขคะแนนเข้ามา และ โปรแกรมจะทำการแสดงผลข้อมูลเกรดออกไปดังตัวอย่าง

grade = int(input())

if grade >= 90 :
    print('A')
elif grade >= 85 :
    print('B+')
elif grade >= 80 :
    print('b')
elif grade >= 75 :
    print('C+')
elif grade >= 70 :
    print('C')
elif grade >= 65 :
    print('D+')
elif grade >= 60 :
    print('D')
elif grade <= 60 :
    print('F')